#pragma once

#include <stack>
#include <iostream>
#include <cstdlib>
#include <ctime>

using std::stack;
using std::string;

class Deck {
	private:
		const string cards[52] = {
			"¢¼A","¢¼2","¢¼3","¢¼4","¢¼5","¢¼6","¢¼7","¢¼8","¢¼9","¢¼0","¢¼J","¢¼Q","¢¼K",
			"¢ÀA","¢À2","¢À3","¢À4","¢À5","¢À6","¢À7","¢À8","¢À9","¢À0","¢ÀJ","¢ÀQ","¢ÀK",
			"¡ßA","¡ß2","¡ß3","¡ß4","¡ß5","¡ß6","¡ß7","¡ß8","¡ß9","¡ß0","¡ßJ","¡ßQ","¡ßK",
			"¢¾A","¢¾2","¢¾3","¢¾4","¢¾5","¢¾6","¢¾7","¢¾8","¢¾9","¢¾0","¢¾J","¢¾Q","¢¾K"
		};// 0 = 10
		short numbers[52] = { 
			0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
			10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
			20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
			30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
			40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
			50, 51 
		};
		stack<string> deck;

	public:
		void shuffle();
		string deal();
		~Deck();
};